onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	
	// Добавляет на форму группу СкидкаКоманда В ГруппаШапкаЛево,реквизит "ДК_СогласованнаяСкидка",кнопку "ДК_ПересчитатьТаблицу" - Минкова 24.07.2024
	СозданиеЭлементовФормы();
	// - Минкова 24.07.202	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// Начало доработки - Минкова 01.08.2024
    // Исходный код:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КоэффициентСкидки = 1 - (ТекущиеДанные.Скидка + Объект.ДК_СогласованнаяСкидка) / 100;
	Если КоэффициентСкидки < 0 Тогда
		Сообщить("Скидка больше 100%. Измените размер скидки!", СтатусСообщения.ОченьВажное);
		ТекущиеДанные.Сумма = 0;
		Возврат;
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КонецЕсли;
	
	РассчитатьСуммуДокумента();
	// Конец доработки	
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура СозданиеЭлементовФормы() Экспорт
	
	// Начало доработки - Минкова 24.07.2024 
	// Добавялет группу СкидкаКоманда В ГруппаШапкаЛево
	Группа = Элементы.Добавить("СкидкаКоманда", Тип("ГруппаФормы"), ЭтаФорма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Группа.ОтображатьЗаголовок = ЛОЖЬ;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	// Добавялет реквизит "ДК_СогласованнаяСкидка" на форму
	ПолеВвода = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДК_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДК_СогласованнаяСкидкаПриИзменении");
	// Добавялет кнопку "ДК_ПересчитатьТаблицу" на форму 
	Команда = Команды.Добавить("ДК_ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "ДК_ПересчитатьТаблицуПосле";
	
    КнопкаФормы = Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Группа);
	КнопкаФормы.ИмяКоманды = "ДК_ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	// Конец доработки		
	
	
КонецПроцедуры 


&НаКлиенте
Процедура ДК_СогласованнаяСкидкаПриИзменении(Элемент)
	
	// {{ Всплывающее окно с вопросом о пересчете ТЧ - Минкова 24.07.2024
	ЗадатьВопросОПересчетеСкидкиАсинхронно();
	// }}
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросОПересчетеСкидкиАсинхронно()
	
	// {{ Проверка на наличие строк в ТЧ - Минкова 24.07.2024
	Если Объект.Товары.Количество() < 1 И Объект.Услуги.Количество() < 1 Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "В табличных частях нет строк";	
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// Всплывающее окно с вопросом о пересчете ТЧ (да/нет)
	ТекстВопроса = "Изменен процент скидки. Пересчитать таблицу?";
	Режим = РежимДиалогаВопрос.ДаНет;
	ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, Режим, 0);
	
	Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ПересчитатьСтрокиТЧ();
		РассчитатьСуммуДокумента();
	КонецЕсли;  
	// }}

	
КонецПроцедуры

&НаКлиенте
Процедура ДК_ПересчитатьТаблицуПосле(Команда)
	
	// {{Команда ПересчитатьТаблицу - Минкова 24.07.2024
	ПересчитатьСтрокиТЧ();
	РассчитатьСуммуДокумента();
	// }} 

КонецПроцедуры 


&НаКлиенте
Процедура ПересчитатьСтрокиТЧ()
	
	// {{ Пересчитывает таблицу с учетом скидки - Минкова 01.08.2024
	ТекстСообщения = "Скидка больше 100%. Измените размер скидки!";
	
	Для Каждого СтрокаТаблинчойЧасти Из Объект.Товары Цикл
		КоэффициентСкидки = 1 - (СтрокаТаблинчойЧасти.Скидка + Объект.ДК_СогласованнаяСкидка) / 100;
			Если КоэффициентСкидки < 0 Тогда			
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;	
				Сообщение.Сообщить();
				СтрокаТаблинчойЧасти.Сумма = 0;
				Возврат;
			Иначе
				СтрокаТаблинчойЧасти.Сумма = (СтрокаТаблинчойЧасти.Цена * СтрокаТаблинчойЧасти.Количество) * КоэффициентСкидки;
			КонецЕсли;
	КонецЦикла;	
	 
	Для Каждого СтрокаТаблинчойЧасти Из Объект.Услуги Цикл
		КоэффициентСкидки = 1 - (СтрокаТаблинчойЧасти.Скидка + Объект.ДК_СогласованнаяСкидка) / 100;
			Если КоэффициентСкидки < 0 Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;	
				Сообщение.Сообщить();
				СтрокаТаблинчойЧасти.Сумма = 0;
				Возврат;
			Иначе
				СтрокаТаблинчойЧасти.Сумма = (СтрокаТаблинчойЧасти.Цена * СтрокаТаблинчойЧасти.Количество) * КоэффициентСкидки;
			КонецЕсли;		
	КонецЦикла;
	// }}
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
